#include"welcome.h"

int i = 0;
int wlcme()		//输出刚开始的界面
{
	int x;
	char a[200][200] = {
		"##                             ##                 ##                                 ##                    ",
		"  ##                             ##   ##          ##          ##                       ##                  ",
		"    ##     ###############         ##   ##        ##        ##        ####################################  ",
		"##                      ##      ######    ##      ##      ##           ##                              ##   ",
		"##     ############     ##          #       ##    ##    ##              ##                            ##    ",
		"##     ##        ##     ##         #          ##  ##  ##                      ###################           ",
		"##     ##        ##     ##        #             ######                        ##               ##           ",
		"##     ##        ##     ##       #      ##########################            ##               ##           ",
		"##     ############     ##      #               ######                        ###################           ",
		"##               ##     ##       #            ##  ##  ##                                                     ",
		"##   ########### ##     ##        #         ##    ##    ##                #############################     ",
		"##               ##     ##         #      ##      ##      ##              ##                         ##     ",
		"##            ## ##     ##          #   ##        ##        ##            ##                         ##     ",
		"##              ###     ##         #  ##          ##          ##          ##                         ##     ",
		"##                #     ##      ##                ##                      ##                         ##     ",
		"##                      ##     #####################################      #############################     ",
	};
	for (x = 0; x <= 15; x++)
		puts(a[x]);
	printf("按任意键继续!\n");
	getch();
	system("cls");
	return 0;
}
int print1()
{
	printf("1.简单	");
	cursor();
	printf("2.普通\n3.困难\n");
	return 0;
}
int print2()
{
	printf("1.简单\n");
	printf("2.普通	");
	cursor();
	printf("3.困难\n");
	return 0;
}
int print3()
{
	printf("1.简单\n2.普通\n");
	printf("3.困难	");
	cursor();
	return 0;
}
int choose()		//输出选项供用户选择相应模式
{
	int a=0;
	char ch;
	ch=getch();
	if (ch == 13) a = 1;
	else if (ch == 's')
	{
		if (i == 2) i = 0;
		else i++;
	}
	else if (ch == 'w' && i != 0) i--;
	else;
	system("cls");
	return a;
}
int cursor()
{
	printf("<---\n");
	return 0;
}